---
kind: enumMember
id: F:Autodesk.Revit.DB.SaveModifiedLinksOptions.DoNotSaveLinks
enum: Autodesk.Revit.DB.SaveModifiedLinksOptions
source: html/0d60b26d-4684-453f-4b90-e252334dac5e.htm
---
# Autodesk.Revit.DB.SaveModifiedLinksOptions.DoNotSaveLinks

Any modified linked files will not be saved. The links will return to their previous
 position the next time the file is loaded.